dominichuggonsonotteo-prog/GridInv3P/MDK_ARM/.pack/Keil/STM32F3xx_DFP.2.1.0/CMSIS/Driver/bxCAN_STM32F3xx.c
  if ((status == ARM_DRIVER_OK)                            && 
     ((ptr_CAN->sFilterRegister[bank].FR1 != 0xFFFFFFFFU)  || 
      (ptr_CAN->sFilterRegister[bank].FR2 != 0xFFFFFFFFU))) {
    ptr_CAN->FA1R |= msk;                                               // Put filter in active mode
  }
  ptr_CAN->FMR  &= ~CAN_FMR_FINIT;                                      // Exit filter initialization mode

  return status;
}

// CAN Driver Functions

/**
  \fn          ARM_DRIVER_VERSION CAN_GetVersion (void)
  \brief       Get driver version.
  \return      ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION CAN_GetVersion (void) { return can_driver_version; }

/**
  \fn          ARM_CAN_CAPABILITIES CAN_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      ARM_CAN_CAPABILITIES
*/
static ARM_CAN_CAPABILITIES CAN_GetCapabilities (void) { return can_driver_capabilities; }

/**
  \fn          int32_t CAN_Initialize (ARM_CAN_SignalUnitEvent_t   cb_unit_event,
                                       ARM_CAN_SignalObjectEvent_t cb_object_event)
  \brief       Initialize CAN interface and register signal (callback) functions.
  \param[in]   cb_unit_event   Pointer to ARM_CAN_SignalUnitEvent callback function
  \param[in]   cb_object_event Pointer to ARM_CAN_SignalObjectEvent callback function
  \return      execution status
*/
static int32_t CAN_Initialize (ARM_CAN_SignalUnitEvent_t   cb_unit_event,
                               ARM_CAN_SignalObjectEvent_t cb_object_event) {

  if (can_driver_initialized != 0U) { return ARM_DRIVER_OK; }

  CAN_SignalUnitEvent   = cb_unit_event;
  CAN_SignalObjectEvent = cb_object_event;

  hcan.Instance = CAN;

  can_driver_initialized = 1U;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t CAN_Uninitialize (void)
  \brief       De-initialize CAN interface.
  \return      execution status
*/
static int32_t CAN_Uninitialize (void) {

  hcan.Instance          = NULL;

  can_driver_initialized = 0U;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t CAN_PowerControl (ARM_POWER_STATE state)
  \brief       Control CAN interface power.
  \param[in]   state  Power state
                 - ARM_POWER_OFF :  power off: no operation possible
                 - ARM_POWER_LOW :  low power mode: retain state, detect and signal wake-up events
                 - ARM_POWER_FULL : power on: full operation at maximum performance
  \return      execution status
*/
static int32_t CAN_PowerControl (ARM_POWER_STATE state) {
  uint32_t msk;
  uint32_t tout_cnt;
  uint8_t  bank;

  switch (state) {
    case ARM_POWER_OFF:
      can_driver_powered = 0U;
      NVIC_DisableIRQ(CAN_TX_IRQn);
      NVIC_DisableIRQ(CAN_RX0_IRQn);
      NVIC_DisableIRQ(CAN_RX1_IRQn);
      NVIC_DisableIRQ(CAN_SCE_IRQn);
      if (hcan.Instance != NULL) {
        HAL_CAN_DeInit (&hcan);
      }
      memset((void *)&can_obj_cfg[0], 0, CAN_TOT_OBJ_NUM);
      break;

    case ARM_POWER_FULL:
      if (can_driver_initialized == 0U) { return ARM_DRIVER_ERROR; }
      if (can_driver_powered     != 0U) { return ARM_DRIVER_OK;    }
      if (hcan.Instance != NULL) {
        HAL_CAN_MspInit(&hcan);
      }

      ptr_CAN->MCR = CAN_MCR_RESET;             // Reset CAN controller
      tout_cnt = SystemCoreClock / 64U;         // Wait, with timeout, for reset to end
      while ((ptr_CAN->MCR & CAN_MCR_RESET) != 0U) {
        if (tout_cnt-- == 0U) { return ARM_DRIVER_ERROR; }
      }

      // Initialize filter banks
      bank = 0U;
      msk  = ((uint32_t)1U << CAN_FILTER_BANK_NUM) - (uint32_t)1U;
      ptr_CAN->FMR  |=  CAN_FMR_FINIT;          // Enter filter initialization mode
      ptr_CAN->FA1R &= ~msk;                    // Put all filters in inactive mode
      ptr_CAN->FM1R &= ~msk;                    // Initialize all filters mode
      ptr_CAN->FS1R &= ~msk;                    // Initialize all filters scale configuration
      while (bank <= CAN_FILTER_BANK_NUM) {     // Go through all banks
        if (bank == CAN_FILTER_BANK_NUM) { break; }
        ptr_CAN->sFilterRegister[bank].FR1 = 0U;
        ptr_CAN->sFilterRegister[bank].FR2 = 0U;
        bank++;
      }

      memset((void *)&can_obj_cfg[0], 0, CAN_TOT_OBJ_NUM);

      ptr_CAN->IER =   CAN_IER_TMEIE  |         // Enable Interrupts
                       CAN_IER_FMPIE0 |
                       CAN_IER_FOVIE0 |
                       CAN_IER_FMPIE1 |
                       CAN_IER_FOVIE1 |
                       CAN_IER_EWGIE  |
                       CAN_IER_EPVIE  |
                       CAN_IER_BOFIE  |
                       CAN_IER_ERRIE  ;

      can_driver_powered = 1U;

      if ((CAN_SignalUnitEvent != NULL) || (CAN_SignalObjectEvent != NULL)) {
        NVIC_ClearPendingIRQ (CAN_TX_IRQn);
        NVIC_EnableIRQ       (CAN_TX_IRQn);
        NVIC_ClearPendingIRQ (CAN_RX0_IRQn);
        NVIC_EnableIRQ       (CAN_RX0_IRQn);
        NVIC_ClearPendingIRQ (CAN_RX1_IRQn);
        NVIC_EnableIRQ       (CAN_RX1_IRQn);
      }
      if (CAN_SignalUnitEvent != NULL) {
        NVIC_ClearPendingIRQ (CAN_SCE_IRQn);
        NVIC_EnableIRQ       (CAN_SCE_IRQn);
      }
      break;

    case ARM_POWER_LOW:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          uint32_t CAN_GetClock (void)
  \brief       Retrieve CAN base clock frequency.
  \return      base clock frequency
*/
static uint32_t CAN_GetClock (void) {
  return HAL_RCC_GetPCLK1Freq();
}

/**
  \fn          int32_t CAN_SetBitrate (ARM_CAN_BITRATE_SELECT select, uint32_t bitrate, uint32_t bit_segments)
  \brief       Set bitrate for CAN interface.
  \param[in]   select       Bitrate selection
                 - ARM_CAN_BITRATE_NOMINAL : nominal (flexible data-rate arbitration) bitrate
                 - ARM_CAN_BITRATE_FD_DATA : flexible data-rate data bitrate
  \param[in]   bitrate      Bitrate
  \param[in]   bit_segments Bit segments settings
  \return      execution status
*/
static int32_t CAN_SetBitrate (ARM_CAN_BITRATE_SELECT select, uint32_t bitrate, uint32_t bit_segments) {
  uint32_t     mcr, sjw, prop_seg, phase_seg1, phase_seg2, pclk, brp, tq_num, tmp, tout_cnt;

  if (select != ARM_CAN_BITRATE_NOMINAL) { return ARM_CAN_INVALID_BITRATE_SELECT; }
  if (can_driver_powered == 0U)          { return ARM_DRIVER_ERROR;               }

