dominichuggonsonotteo-prog/GridInv3P/MDK_ARM/.pack/Keil/STM32F3xx_DFP.2.1.0/CMSIS/Driver/bxCAN_STM32F3xx.c
  switch (control & ARM_CAN_CONTROL_Msk) {
    case ARM_CAN_ABORT_MESSAGE_SEND:
      if ((arg < CAN_RX_OBJ_NUM) || (arg >= CAN_TOT_OBJ_NUM)) { return ARM_DRIVER_ERROR_PARAMETER; }
      arg -= CAN_RX_OBJ_NUM;
      switch (arg) {
        case 0:
          ptr_CAN->TSR = CAN_TSR_ABRQ0;
          break;
        case 1:
          ptr_CAN->TSR = CAN_TSR_ABRQ1;
          break;
        case 2:
          ptr_CAN->TSR = CAN_TSR_ABRQ2;
          break;
        default:
          return ARM_DRIVER_ERROR_PARAMETER;
      }
      break;
    case ARM_CAN_CONTROL_RETRANSMISSION:
      switch (arg) {
        case 0:
          ptr_CAN->MCR |=  CAN_MCR_NART;
          break;
        case 1:
          ptr_CAN->MCR &= ~CAN_MCR_NART;
          break;
        default:
          return ARM_DRIVER_ERROR_PARAMETER;
      }
      break;
    case ARM_CAN_SET_FD_MODE:
    case ARM_CAN_SET_TRANSCEIVER_DELAY:
    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          ARM_CAN_STATUS CAN_GetStatus (void)
  \brief       Get CAN status.
  \return      CAN status ARM_CAN_STATUS
*/
static ARM_CAN_STATUS CAN_GetStatus (void) {
  ARM_CAN_STATUS  can_status;
  uint32_t        esr;

  esr          = ptr_CAN->ESR;
  ptr_CAN->ESR = CAN_ESR_LEC;           // Software set last error code to unused value

  if       ((ptr_CAN->MSR & CAN_MSR_INAK) != 0U)  { can_status.unit_state = ARM_CAN_UNIT_STATE_INACTIVE; }
  else if (((ptr_CAN->BTR & CAN_BTR_LBKM) != 0U) ||
           ((ptr_CAN->BTR & CAN_BTR_SILM) != 0U)) { can_status.unit_state = ARM_CAN_UNIT_STATE_PASSIVE;  }
  else if ((esr & CAN_ESR_BOFF) != 0U)            { can_status.unit_state = ARM_CAN_UNIT_STATE_INACTIVE; }
  else if ((esr & CAN_ESR_EPVF) != 0U)            { can_status.unit_state = ARM_CAN_UNIT_STATE_PASSIVE;  }
  else                                            { can_status.unit_state = ARM_CAN_UNIT_STATE_ACTIVE;   }

  switch ((esr & CAN_ESR_LEC) >> 4) {
    case 0:
      can_status.last_error_code = ARM_CAN_LEC_NO_ERROR;
      break;
    case 1:
      can_status.last_error_code = ARM_CAN_LEC_STUFF_ERROR;
      break;
    case 2:
      can_status.last_error_code = ARM_CAN_LEC_FORM_ERROR;
      break;
    case 3:
      can_status.last_error_code = ARM_CAN_LEC_ACK_ERROR;
      break;
    case 4:
    case 5:
      can_status.last_error_code = ARM_CAN_LEC_BIT_ERROR;
      break;
    case 6:
      can_status.last_error_code = ARM_CAN_LEC_CRC_ERROR;
      break;
    case 7:
      can_status.last_error_code = ARM_CAN_LEC_NO_ERROR;
      break;
  }

  can_status.tx_error_count = (uint8_t)((esr & CAN_ESR_TEC) >> 16);
  can_status.rx_error_count = (uint8_t)((esr & CAN_ESR_REC) >> 24);

  return can_status;
}

/**
  \fn          void CAN_TX_IRQHandler (void)
  \brief       CAN Transmit Interrupt Routine (IRQ).
*/
void CAN_TX_IRQHandler (void) {
  uint32_t esr, ier;

  if ((CAN->TSR & CAN_TSR_TXOK0) != 0U) {
    if (can_obj_cfg[CAN_RX_OBJ_NUM] == ARM_CAN_OBJ_TX) {
      if (CAN_SignalObjectEvent != NULL) { CAN_SignalObjectEvent(CAN_RX_OBJ_NUM, ARM_CAN_EVENT_SEND_COMPLETE); }
    }
    CAN->TSR = CAN_TSR_RQCP0;           // Request completed on transmit mailbox 0
  }
  if ((CAN->TSR & CAN_TSR_TXOK1) != 0U) {
    if (can_obj_cfg[CAN_RX_OBJ_NUM+1U] == ARM_CAN_OBJ_TX) {
      if (CAN_SignalObjectEvent != NULL) { CAN_SignalObjectEvent(CAN_RX_OBJ_NUM+1U, ARM_CAN_EVENT_SEND_COMPLETE); }
    }
    CAN->TSR = CAN_TSR_RQCP1;           // Request completed on transmit mailbox 1
  }
  if ((CAN->TSR & CAN_TSR_TXOK2) != 0U) {
    if (can_obj_cfg[CAN_RX_OBJ_NUM+2U] == ARM_CAN_OBJ_TX) {
      if (CAN_SignalObjectEvent != NULL) { CAN_SignalObjectEvent(CAN_RX_OBJ_NUM+2U, ARM_CAN_EVENT_SEND_COMPLETE); }
    }
    CAN->TSR = CAN_TSR_RQCP2;           // Request completed on transmit mailbox 2
  }

  // Handle transition from from 'bus off', ' error active' state, or re-enable warning interrupt
  esr = CAN->ESR;
  ier = CAN->IER;
  if (((esr & CAN_ESR_BOFF) == 0U) && ((ier & CAN_IER_BOFIE) == 0U)) { 
    CAN->IER |= CAN_IER_BOFIE;
    if (CAN_SignalUnitEvent != NULL) { CAN_SignalUnitEvent(ARM_CAN_EVENT_UNIT_PASSIVE); }
  }
  if (((esr & CAN_ESR_EPVF) == 0U) && ((ier & CAN_IER_EPVIE) == 0U)) {
    CAN->IER |= CAN_IER_EPVIE;
    if (CAN_SignalUnitEvent != NULL) { CAN_SignalUnitEvent(ARM_CAN_EVENT_UNIT_ACTIVE); }
  }
  if (((esr & CAN_ESR_EWGF) == 0U) && ((ier & CAN_IER_EWGIE) == 0U) && (((esr & CAN_ESR_TEC) >> 16) == 95U) && (((esr & CAN_ESR_REC) >> 24) < 95U)) {
    CAN->IER |= CAN_IER_EWGIE;
  }
}

/**
  \fn          void CAN_RX0_IRQHandler (void)
  \brief       CAN Receive on FIFO0 Interrupt Routine (IRQ).
*/
void CAN_RX0_IRQHandler (void) {
  uint32_t esr, ier;

  if (can_obj_cfg[0] == ARM_CAN_OBJ_RX) {
    if ((CAN->RF0R & CAN_RF0R_FOVR0) != 0U) {
      CAN->RF0R = CAN_RF0R_FOVR0;       // Clear overrun flag
      if (CAN_SignalObjectEvent != NULL) { CAN_SignalObjectEvent(0U, ARM_CAN_EVENT_RECEIVE | ARM_CAN_EVENT_RECEIVE_OVERRUN); }
    } else if ((CAN->RF0R & CAN_RF0R_FMP0) != 0U) {
      if (CAN_SignalObjectEvent != NULL) { CAN_SignalObjectEvent(0U, ARM_CAN_EVENT_RECEIVE); }
    }
  } else {
    CAN->RF0R = CAN_RF0R_RFOM0;         // Release FIFO 0 output mailbox if object not enabled for reception
  }

  // Handle transition from from 'bus off', ' error active' state, or re-enable warning interrupt
  esr = CAN->ESR;
  ier = CAN->IER;
  if (((esr & CAN_ESR_BOFF) == 0U) && ((ier & CAN_IER_BOFIE) == 0U)) { 
    CAN->IER |= CAN_IER_BOFIE;
    if (CAN_SignalUnitEvent != NULL) { CAN_SignalUnitEvent(ARM_CAN_EVENT_UNIT_PASSIVE); }
  }
  if (((esr & CAN_ESR_EPVF) == 0U) && ((ier & CAN_IER_EPVIE) == 0U)) {
    CAN->IER |= CAN_IER_EPVIE;
    if (CAN_SignalUnitEvent != NULL) { CAN_SignalUnitEvent(ARM_CAN_EVENT_UNIT_ACTIVE); }
  }
  if (((esr & CAN_ESR_EWGF) == 0U) && ((ier & CAN_IER_EWGIE) == 0U) && (((esr & CAN_ESR_TEC) >> 16) < 95U) && (((esr & CAN_ESR_REC) >> 24) == 95U)) {
    CAN->IER |= CAN_IER_EWGIE;
  }
}

/**
  \fn          void CAN_RX1_IRQHandler (void)
  \brief       CAN Receive on FIFO1 Interrupt Routine (IRQ).
*/
void CAN_RX1_IRQHandler (void) {
  uint32_t esr, ier;

  if (can_obj_cfg[1] == ARM_CAN_OBJ_RX) {
    if ((CAN->RF1R & CAN_RF1R_FOVR1) != 0U) {
      CAN->RF1R = CAN_RF1R_FOVR1;       // Clear overrun flag
      if (CAN_SignalObjectEvent != NULL) { CAN_SignalObjectEvent(1U, ARM_CAN_EVENT_RECEIVE | ARM_CAN_EVENT_RECEIVE_OVERRUN); }
    } else if ((CAN->RF1R & CAN_RF1R_FMP1) != 0U) {
      if (CAN_SignalObjectEvent != NULL) { CAN_SignalObjectEvent(1U, ARM_CAN_EVENT_RECEIVE); }
    }
  } else {
    CAN->RF1R = CAN_RF1R_RFOM1;         // Release FIFO 1 output mailbox if object not enabled for reception
  }

  // Handle transition from from 'bus off', ' error active' state, or re-enable warning interrupt
  esr = CAN->ESR;
  ier = CAN->IER;
  if (((esr & CAN_ESR_BOFF) == 0U) && ((ier & CAN_IER_BOFIE) == 0U)) { 
    CAN->IER |= CAN_IER_BOFIE;
    if (CAN_SignalUnitEvent != NULL) { CAN_SignalUnitEvent(ARM_CAN_EVENT_UNIT_PASSIVE); }
  }
  if (((esr & CAN_ESR_EPVF) == 0U) && ((ier & CAN_IER_EPVIE) == 0U)) {
    CAN->IER |= CAN_IER_EPVIE;
    if (CAN_SignalUnitEvent != NULL) { CAN_SignalUnitEvent(ARM_CAN_EVENT_UNIT_ACTIVE); }
  }
  if (((esr & CAN_ESR_EWGF) == 0U) && ((ier & CAN_IER_EWGIE) == 0U) && (((esr & CAN_ESR_TEC) >> 16) < 95U) && (((esr & CAN_ESR_REC) >> 24) == 95U)) {
    CAN->IER |= CAN_IER_EWGIE;
  }
}

/**
  \fn          void CAN_SCE_IRQHandler (void)
  \brief       CAN Error and Status Change Interrupt Routine (IRQ).
*/
void CAN_SCE_IRQHandler (void) {
  uint32_t esr, ier;

  if (CAN_SignalUnitEvent != NULL) {
    esr = CAN->ESR;
    ier = CAN->IER;
    CAN->MSR = CAN_MSR_ERRI;            // Clear error interrupt
    if      (((esr & CAN_ESR_BOFF) != 0U) && ((ier & CAN_IER_BOFIE) != 0U)) { CAN->IER &= ~CAN_IER_BOFIE; CAN_SignalUnitEvent(ARM_CAN_EVENT_UNIT_BUS_OFF); }
    else if (((esr & CAN_ESR_EPVF) != 0U) && ((ier & CAN_IER_EPVIE) != 0U)) { CAN->IER &= ~CAN_IER_EPVIE; CAN_SignalUnitEvent(ARM_CAN_EVENT_UNIT_PASSIVE); }
    else if (((esr & CAN_ESR_EWGF) != 0U) && ((ier & CAN_IER_EWGIE) != 0U)) { CAN->IER &= ~CAN_IER_EWGIE; CAN_SignalUnitEvent(ARM_CAN_EVENT_UNIT_WARNING); }
  }
}


// Exported driver structure
ARM_DRIVER_CAN Driver_CAN1 = {
  CAN_GetVersion,
  CAN_GetCapabilities,
  CAN_Initialize,
  CAN_Uninitialize,
  CAN_PowerControl,
  CAN_GetClock,
  CAN_SetBitrate,
  CAN_SetMode,
  CAN_ObjectGetCapabilities,
  CAN_ObjectSetFilter,
  CAN_ObjectConfigure,
  CAN_MessageSend,
  CAN_MessageRead,
  CAN_Control,
  CAN_GetStatus
};

/*! \endcond */
